{
  "pages": {
    "index": {
      "title": "Free Image Tools Online - Crop, Merge, Compress & More",
      "description": "Free online image processing tools. Crop, merge, compress, resize images and remove objects directly in your browser. No upload required.",
      "keywords": "image tools, crop image, merge images, compress image, resize image, remove object, online, free",
      "og:image": "/assets/og-default.svg"
    },
    "crop": {
      "title": "Crop Image Online - Free Image Tools",
      "description": "Free online image cropping tool. Crop images to desired dimensions with aspect ratio options. No upload required.",
      "keywords": "crop image, image cropper, online crop tool, free image cropping, aspect ratio",
      "og:image": "/assets/og-crop.png"
    },
    "merge": {
      "title": "Merge Images Online - Free Image Tools",
      "description": "Combine multiple images into one. Free online image merging tool with customizable layout options.",
      "keywords": "merge images, combine images, image merger, photo collage, image stitching",
      "og:image": "/assets/og-merge.png"
    },
    "remove-object": {
      "title": "Remove Object Online - Free Image Tools",
      "description": "Remove unwanted objects from images. Free online object removal tool with AI-powered inpainting.",
      "keywords": "remove object, remove person, object removal, photo retouching, image editing",
      "og:image": "/assets/og-remove-object.png"
    },
    "black-image": {
      "title": "Create Black Image Online - Free Image Tools",
      "description": "Create solid black images with custom dimensions. Free online black image generator.",
      "keywords": "black image, solid color image, create image, image generator, placeholder image",
      "og:image": "/assets/og-black-image.png"
    },
    "compress": {
      "title": "Compress Image Online - Free Image Tools",
      "description": "Compress images to reduce file size while maintaining quality. Free online image compression tool.",
      "keywords": "compress image, image compression, reduce file size, optimize image, image optimizer",
      "og:image": "/assets/og-compress.png"
    },
    "resize": {
      "title": "Resize Image Online - Free Image Tools",
      "description": "Resize images to desired dimensions. Free online image resizing tool with aspect ratio lock.",
      "keywords": "resize image, image resizer, change image size, scale image, image dimensions",
      "og:image": "/assets/og-resize.png"
    }
  }
}